In [1]:
import pandas as pd

df = pd.DataFrame([
    [1, "20-25", 4,  "Ibis",       "veg",        1300,   2,   40000,   "20-25"],
    [2, "30-35", 5,  "LemonTree",  "Non-Veg",    2000,   3,   59000,   "30-35"],
    [3, "25-30", 6,  "RedFox",     "Veg",        1322,   2,   30000,   "25-30"],
    [4, "20-25", -1, "LemonTree",  "Veg",        1234,   2,  120000,   "20-25"],
    [5, "35+",   3,  "Ibis",       "Vegetarian",  989,   2,   45000,   "35+"],
    [6, "35+",   3,  "Ibys",       "Non-Veg",    1909,   2,  122220,   "35+"],
    [7, "35+",   4,  "RedFox",     "Vegetarian", 1000,  -1,   21122,   "35+"],
    [8, "20-25", 7,  "LemonTree",  "Veg",        2999, -10,  345673,   "20-25"],
    [9, "25-30", 2,  "Ibis",       "Non-Veg",    3456,   3,  -99999,   "25-30"],
    [9, "25-30", 2,  "Ibis",       "Non-Veg",    3456,   3,  -99999,   "25-30"],
    [10,"30-35", 5,  "RedFox",     "non-Veg",   -6755,   4,   87777,   "30-35"],
], columns=[
    "CustomerID",
    "Age_Group",
    "Rating",
    "Hotel",
    "FoodPreference",
    "Bill",
    "NoOfPax",
    "EstimatedSalary",
    "Age_Group_1"
])

df

,CustomerID,Age_Group,Rating,Hotel,FoodPreference,Bill,NoOfPax,EstimatedSalary,Age_Group_1
0,1,20-25,4,Ibis,veg,1300,2,40000,20-25
1,2,30-35,5,LemonTree,Non-Veg,2000,3,59000,30-35
2,3,25-30,6,RedFox,Veg,1322,2,30000,25-30
3,4,20-25,-1,LemonTree,Veg,1234,2,120000,20-25
4,5,35+,3,Ibis,Vegetarian,989,2,45000,35+
5,6,35+,3,Ibys,Non-Veg,1909,2,122220,35+
6,7,35+,4,RedFox,Vegetarian,1000,-1,21122,35+
7,8,20-25,7,LemonTree,Veg,2999,-10,345673,20-25
8,9,25-30,2,Ibis,Non-Veg,3456,3,-99999,25-30
9,9,25-30,2,Ibis,Non-Veg,3456,3,-99999,25-30
10,10,30-35,5,RedFox,non-Veg,-6755,4,87777,30-35

In [2]:
df

,CustomerID,Age_Group,Rating,Hotel,FoodPreference,Bill,NoOfPax,EstimatedSalary,Age_Group_1
0,1,20-25,4,Ibis,veg,1300,2,40000,20-25
1,2,30-35,5,LemonTree,Non-Veg,2000,3,59000,30-35
2,3,25-30,6,RedFox,Veg,1322,2,30000,25-30
3,4,20-25,-1,LemonTree,Veg,1234,2,120000,20-25
4,5,35+,3,Ibis,Vegetarian,989,2,45000,35+
5,6,35+,3,Ibys,Non-Veg,1909,2,122220,35+
6,7,35+,4,RedFox,Vegetarian,1000,-1,21122,35+
7,8,20-25,7,LemonTree,Veg,2999,-10,345673,20-25
8,9,25-30,2,Ibis,Non-Veg,3456,3,-99999,25-30
9,9,25-30,2,Ibis,Non-Veg,3456,3,-99999,25-30
10,10,30-35,5,RedFox,non-Veg,-6755,4,87777,30-35

In [3]:
df.drop_duplicates(inplace = True)

In [4]:
df.reset_index(inplace = True)

In [5]:
df.drop(["Age_Group_1","index"],axis = 1, inplace = True)

In [6]:
display(df.head(5),df.info(),df.describe())

df["CustomerID"] = df["CustomerID"].astype("str")
df["Rating"] = df["Rating"].astype("int64")
df["Bill"] = df["Bill"].astype("float64")
df["EstimatedSalary"] = df["EstimatedSalary"].astype("float64")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerID       10 non-null     int64
 1   Age_Group        10 non-null     object
 2   Rating           10 non-null     int64
 3   Hotel            10 non-null     object
 4   FoodPreference   10 non-null     object
 5   Bill             10 non-null     int64
 6   NoOfPax          10 non-null     int64
 7   EstimatedSalary  10 non-null     int64
dtypes: int64(5), object(3)
memory usage: 768.0+ bytes

,CustomerID,Age_Group,Rating,Hotel,FoodPreference,Bill,NoOfPax,EstimatedSalary
0,1,20-25,4,Ibis,veg,1300,2,40000
1,2,30-35,5,LemonTree,Non-Veg,2000,3,59000
2,3,25-30,6,RedFox,Veg,1322,2,30000
3,4,20-25,-1,LemonTree,Veg,1234,2,120000
4,5,35+,3,Ibis,Vegetarian,989,2,45000

None

       CustomerID     Rating         Bill    NoOfPax  EstimatedSalary
count    10.00000  10.000000    10.000000  10.000000        10.000000
mean      5.50000   3.800000   945.400000   0.900000     77079.300000
std       3.02765   2.250926  2832.607601   4.040077    113319.659498
min       1.00000  -1.000000 -6755.000000 -10.000000    -99999.000000
25%       3.25000   3.000000  1058.500000   2.000000     32500.000000
50%       5.50000   4.000000  1311.000000   2.000000     52000.000000
75%       7.75000   5.000000  1977.250000   2.750000    111944.250000
max      10.00000   7.000000  3456.000000   4.000000    345673.000000

In [7]:
import numpy as np 
df.loc[(df["Rating"] > 10) | (df["Rating"] < 1),"Rating"] = np.nan

In [8]:
for i in df.columns:
    unique_values = df[i].unique()
    print("columns : {} : {}".format(i,unique_values))

columns : CustomerID : ['1' '2' '3' '4' '5' '6' '7' '8' '9' '10']
columns : Age_Group : ['20-25' '30-35' '25-30' '35+']
columns : Rating : [ 4.  5.  6. nan  3.  7.  2.]
columns : Hotel : ['Ibis' 'LemonTree' 'RedFox' 'Ibys']
columns : FoodPreference : ['veg' 'Non-Veg' 'Veg' 'Vegetarian' 'non-Veg']
columns : Bill : [ 1300.  2000.  1322.  1234.   989.  1909.  1000.  2999.  3456. -6755.]
columns : NoOfPax : [  2   3  -1 -10   4]
columns : EstimatedSalary : [ 40000.  59000.  30000. 120000.  45000. 122220.  21122. 345673. -99999.
  87777.]

In [9]:
df.replace(["Ibys","Ibis"],"Ibis",inplace = True)

In [10]:
df.replace(["Non-Veg","non-Veg"],"Non-Veg",inplace = True)
df.replace(["Veg","veg","Vegetarian"],"Veg",inplace = True)

In [11]:
df.loc[(df["Bill"] < 0.1),"Bill"]= np.nan

In [12]:
df.replace(["Veg,Vegiterian,veggie"],"Veg",inplace = True)

In [13]:
df.loc[df["NoOfPax"] < 1,"NoOfPax"] = np.nan

In [14]:
df.loc[df.EstimatedSalary < 1 ,"EstimatedSalary"] = np.nan

In [15]:
df.drop_duplicates(inplace = True)

In [16]:
df.describe()

         Rating         Bill   NoOfPax  EstimatedSalary
count  9.000000     9.000000  8.000000         9.000000
mean   4.333333  1801.000000  2.500000     96754.666667
std    1.581139   889.407809  0.755929    100456.024114
min    2.000000   989.000000  2.000000     21122.000000
25%    3.000000  1234.000000  2.000000     40000.000000
50%    4.000000  1322.000000  2.000000     59000.000000
75%    5.000000  2000.000000  3.000000    120000.000000
max    7.000000  3456.000000  4.000000    345673.000000

In [17]:
#If data is symmetric ‚Üí Mean
#If data is skewed / has outliers ‚Üí Median

In [18]:
df.Rating.fillna(df.Rating.median(), inplace = True)

C:\Users\sriha\AppData\Local\Temp\ipykernel_7952\1571570925.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Rating.fillna(df.Rating.median(), inplace = True)

In [19]:
df.Bill.fillna(df.Bill.median(),inplace = True)

C:\Users\sriha\AppData\Local\Temp\ipykernel_7952\3399625547.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Bill.fillna(df.Bill.median(),inplace = True)

In [20]:
df.fillna(np.round(df["NoOfPax"].mean()),inplace = True)

In [21]:
np.round(3.5)

np.float64(4.0)

In [22]:
df

,CustomerID,Age_Group,Rating,Hotel,FoodPreference,Bill,NoOfPax,EstimatedSalary
0,1,20-25,4.0,Ibis,Veg,1300.0,2.0,40000.0
1,2,30-35,5.0,LemonTree,Non-Veg,2000.0,3.0,59000.0
2,3,25-30,6.0,RedFox,Veg,1322.0,2.0,30000.0
3,4,20-25,4.0,LemonTree,Veg,1234.0,2.0,120000.0
4,5,35+,3.0,Ibis,Veg,989.0,2.0,45000.0
5,6,35+,3.0,Ibis,Non-Veg,1909.0,2.0,122220.0
6,7,35+,4.0,RedFox,Veg,1000.0,2.0,21122.0
7,8,20-25,7.0,LemonTree,Veg,2999.0,2.0,345673.0
8,9,25-30,2.0,Ibis,Non-Veg,3456.0,3.0,2.0
9,10,30-35,5.0,RedFox,Non-Veg,1322.0,4.0,87777.0

Label and One hot encoding

In [42]:
import pandas as pd
import numpy as np

data = {
    "Country": ["France", "Spain", "Germany", "Spain", "Germany",
                "France", "Spain", "France", "France", "France"],
    "Age": [44.0, 27.0, 30.0, 38.0, 40.0, 35.0, np.nan, 48.0, 50.0, 37.0],
    "Salary": [72000.0, 48000.0, 54000.0, 61000.0, np.nan,
               58000.0, 52000.0, 79000.0, 83000.0, 67000.0],
    "Purchased": ["No", "Yes", "No", "No", "Yes",
                  "Yes", "No", "Yes", "No", "Yes"],
    "Rating": ["Good", "Average", "Good", "Average", "Excellent",
               "Good", "Poor", "Excellent", "Good", "Excellent"]
}

df = pd.DataFrame(data)
df

   Country   Age   Salary Purchased     Rating
0   France  44.0  72000.0        No       Good
1    Spain  27.0  48000.0       Yes    Average
2  Germany  30.0  54000.0        No       Good
3    Spain  38.0  61000.0        No    Average
4  Germany  40.0      NaN       Yes  Excellent
5   France  35.0  58000.0       Yes       Good
6    Spain   NaN  52000.0        No       Poor
7   France  48.0  79000.0       Yes  Excellent
8   France  50.0  83000.0        No       Good
9   France  37.0  67000.0       Yes  Excellent

2Ô∏è‚É£ Relationship between Mean, Median, Mode

This is the key rule interviewers want.

üëâ Right-skewed
Mode < Median < Mean


Why?

Extreme high values pull the mean to the right

üëâ Left-skewed
Mean < Median < Mode


Why?

Extreme low values pull the mean to the left

üëâ Symmetric (Normal)
Mean = Median = Mode

In [24]:
display(df.head(5),df.info(),df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
 4   Rating     10 non-null     object
dtypes: float64(2), object(3)
memory usage: 528.0+ bytes

   Country   Age   Salary Purchased     Rating
0   France  44.0  72000.0        No       Good
1    Spain  27.0  48000.0       Yes    Average
2  Germany  30.0  54000.0        No       Good
3    Spain  38.0  61000.0        No    Average
4  Germany  40.0      NaN       Yes  Excellent

None

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

Tree-based models don‚Äôt interpret numeric magnitude; they only use feature values to split data into subsets.

In [25]:
from sklearn.preprocessing import LabelEncoder 

label_encoder_country = LabelEncoder()
label_encoder_purchased = LabelEncoder()
df["Country"] = label_encoder_country.fit_transform(df["Country"])
df["Purchased"] = label_encoder_purchased.fit_transform(df["Purchased"])

üå≥ TREE-BASED vs üìê LINEAR / DISTANCE MODELS (CATEGORICALS)
CORE DIFFERENCE (THIS IS EVERYTHING)
üå≥ Tree-based models

Think in IF / ELSE

Ask YES / NO questions

Do subsetting, not math

Do NOT care about numeric magnitude

Example split:

Is Country in {France, Germany} ?


‚û° Numbers are just IDs
‚û° LabelEncoder is OK

üìê Linear / Distance-based models

Do math

Multiply, add, subtract

Compute distance

Care about numeric magnitude

Example:

y = w * Country
distance = |2 - 0|


‚û° LabelEncoder creates fake meaning
‚û° One-Hot Encoding is REQUIRED

WHAT TO USE (MEMORISE)
Model type	Label Encoding	One-Hot Encoding
Tree-based	‚úÖ OK	‚úÖ OK
Linear / Logistic	‚ùå NO	‚úÖ YES
KNN / SVM	‚ùå NO	‚úÖ YES
ONE-LINE INTERVIEW ANSWER üéØ

‚ÄúTree-based models split data into subsets using rules, so label-encoded categories don‚Äôt introduce numerical bias, whereas linear and distance-based models require one-hot encoding to avoid artificial ordering.‚Äù

ONE-LINE MEMORY HOOK üß†
Trees ‚Üí rules ‚Üí subsets ‚Üí Label OK
Linear ‚Üí math ‚Üí distance ‚Üí One-Hot


That‚Äôs it.
If you can say this much clearly, you‚Äôre already ahead of most candidates.

In [26]:
display(label_encoder_country.classes_,label_encoder_purchased.classes_)

array(['France', 'Germany', 'Spain'], dtype=object)

array(['No', 'Yes'], dtype=object)

In [27]:
df.Rating.unique()

array(['Good', 'Average', 'Excellent', 'Poor'], dtype=object)

In [30]:
from sklearn.preprocessing import OrdinalEncoder

order = [["Poor","Average","Good","Excellent"]]
ordinal_encoder_purchased = OrdinalEncoder(categories = order)


df["Rating"] = ordinal_encoder_purchased.fit_transform(df[["Rating"]])

In [31]:
df

   Country   Age   Salary  Purchased  Rating
0        0  44.0  72000.0          0     2.0
1        2  27.0  48000.0          1     1.0
2        1  30.0  54000.0          0     2.0
3        2  38.0  61000.0          0     1.0
4        1  40.0      NaN          1     3.0
5        0  35.0  58000.0          1     2.0
6        2   NaN  52000.0          0     0.0
7        0  48.0  79000.0          1     3.0
8        0  50.0  83000.0          0     2.0
9        0  37.0  67000.0          1     3.0

In [48]:
from sklearn.preprocessing import OneHotEncoder

ohe = OneHotEncoder(sparse_output=False, drop="first")

country_encoded = ohe.fit_transform(df[["Country"]])
country_encoded

array([[0., 0.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 0.],
       [0., 1.],
       [0., 0.],
       [0., 0.],
       [0., 0.]])

In [49]:

country_df = pd.DataFrame(country_encoded,columns = ohe.get_feature_names_out(["Country"]),index = df.index)
country_df

   Country_Germany  Country_Spain
0              0.0            0.0
1              0.0            1.0
2              1.0            0.0
3              0.0            1.0
4              1.0            0.0
5              0.0            0.0
6              0.0            1.0
7              0.0            0.0
8              0.0            0.0
9              0.0            0.0

In [52]:
df.drop(["Country"],inplace = True,axis = 1)

In [56]:
final_df = pd.concat([df,country_df],axis = 1)

In [57]:
final_df

    Age   Salary Purchased     Rating  Country_Germany  Country_Spain
0  44.0  72000.0        No       Good              0.0            0.0
1  27.0  48000.0       Yes    Average              0.0            1.0
2  30.0  54000.0        No       Good              1.0            0.0
3  38.0  61000.0        No    Average              0.0            1.0
4  40.0      NaN       Yes  Excellent              1.0            0.0
5  35.0  58000.0       Yes       Good              0.0            0.0
6   NaN  52000.0        No       Poor              0.0            1.0
7  48.0  79000.0       Yes  Excellent              0.0            0.0
8  50.0  83000.0        No       Good              0.0            0.0
9  37.0  67000.0       Yes  Excellent              0.0            0.0

What each method actually tells you (very clearly)
‚ùå Correlation

Tells: linear association between two numeric variables

Does NOT tell:

causation

non-linear effects

interaction effects

importance for classification

üëâ Useful for EDA sanity checks, not feature importance.

‚úÖ Logistic regression coefficients

Tell: direction and strength of linear effect on the label

Relationship type:

monotonic

additive

Good when:

model is linear

interpretability matters

üëâ Explains how a feature affects the label (linearly).

‚úÖ Tree feature importance

Tell: which features the model uses most to split

Captures:

non-linear relationships

interactions

Model-dependent:

importance ‚â† true causality

üëâ Explains what the model relies on.

‚úÖ Permutation importance (very important)

Tell: how much a feature affects prediction performance

Works for:

any model

any feature type

Measures:

impact on accuracy / AUC / loss

üëâ Best practical answer to
‚ÄúDoes this feature matter for predicting the label?‚Äù

‚úÖ SHAP

Tell:

global importance (overall)

local importance (per prediction)

direction + magnitude

Captures:

non-linearity

interactions

Closest thing to a full explanation.

üëâ Best tool to explain why the model predicts the label.

‚úÖ Mutual Information

Tell: dependency between feature and label

Does NOT assume:

linearity

Good for:

feature screening

early analysis

üëâ Answers: ‚ÄúIs there any signal at all?‚Äù

So‚Ä¶ are these enough?
‚úÖ YES ‚Äî together, they are sufficient to understand:

whether a feature is related to the label

whether the relationship is linear or non-linear

whether the feature actually helps prediction

how the model is using that feature

‚ùå NO single method is enough alone

You need at least one of:

model-based importance (tree / permutation / SHAP)

plus optional EDA (correlation / MI)

One sentence you should remember (and say in interviews)

‚ÄúFeature‚Äìlabel relationships in classification are best understood through model-based importance methods rather than correlation alone.‚Äù

That sentence is spot on.

Final simplified rule üß†
EDA        ‚Üí correlation, MI
Prediction ‚Üí permutation importance
Explanation‚Üí SHAP / coefficients


So yes ‚Äî what you listed is the right toolkit.
At this point, your understanding is correct and complete for interviews and real work.